### 强缓存

http 1.0 使用的是 `Expires` 格式是时间戳，但是这个会根据本地时间来确定，如果手动修改本地日期，那么缓存就不会按照预期来执行，所以 http1.1 开始使用 cache-control 进行增强优化，使用单位是时间长度 max-age ，两者这个优先级会更高。

### 协商缓存

协商缓存依赖于服务端与浏览器之间的通信， 首先第一次请求时 服务端会在响应头加入 `Last-Modified` 时间戳，浏览器下一次请求时会携带上 If-Modified-Since，对应的值是 Last-modified 服务器接收到这个时间戳后，会比对该时间戳和资源在服务器上的最后修改时间是否一致，从而判断资源是否发生了变化。 如果发生了变化，就会返回一个完整的响应内容，并在 Response Headers 中添加新的 Last-Modified 值；否则，返回 304 响应。

但有个弊端就是 如果文件编辑了，但是没有修改内容。 这时服务端会按照最后编辑时间来判断资源是否发生了修改，实质上的问题是： 服务器并没有正确感知文件的变化    所以 ETag 作为补充出现了。Etag 由服务器为每个资源生成的唯一的标识字符串，这个标识字符串可以是基于文件内容编码的，只要文件内容不同，它们对应的 Etag 就是不同的。 弊端是 Etag 由服务端计算，会造成服务端的损耗，浏览器下次访问是 带上 IF-not-match ，对应的值是上一次 Etag 的值。 

Etag 并不能替代 Last-Modified，它只能作为 Last-Modified 的补充和强化存在。 

`Etag 在感知文件变化上比 Last-Modified 更加准确，优先级也更高。当 Etag 和 Last-Modified 同时存在时，以 Etag 为准。`